---
kind: method
id: M:Autodesk.Revit.DB.SunAndShadowSettings.IsFrameValid(System.Double)
source: html/998481b3-00fe-dbe9-1152-10466d565753.htm
---
# Autodesk.Revit.DB.SunAndShadowSettings.IsFrameValid Method

Checks whether the frame is valid for the supplied SunAndShadowSettings.

## Syntax (C#)
```csharp
public bool IsFrameValid(
	double frame
)
```

## Parameters
- **frame** (`System.Double`) - Frame value

## Returns
True if the frame is valid for the SunAndShadowSettings, false otherwise.